# Pandas Data Structures

This is the first section to deal specifically with Pandas. Pandas is a powerful data analysis library that makes data science work much easier than it once was.

## Section 2.0: Dataframes

Load the pandas package, and assign it a shorthand name, 'pd'.

In [1]:
import pandas as pd

Don't worry about understanding this block of code, but you will need to run it to do the rest of this exercise. 
The important thing is, it stores a dataframe you can use into the variable named "df". 
We are using this instead of the pd.read_csv() function to load a dataframe for the purposes of these exercises. The read_csv() function is often used to load a dataframe from a .csv file, but given the Jupyter notebooks format, it is easier to load a dataframe this way for the purposes of this exercise.

In [2]:
import random

workout_dict = {'ID': [], 'Measurement Device': [], 'Heart Rate Max': [], 'Heart Rate Min': [], 'Heart Rate Avg': [],
              'Duration of exercise (min)': [], 'Exercise Type': []}
used_ids = []

for x in range(0, 500):
    id = random.randint(100000000, 999999999)
    while id in used_ids:
        id = random.randint(100000000, 999999999)
    used_ids.append(id)
    device = random.choice(['Skykandal', 'B-Wolf'])
    mu = random.randint(65, 85)
    min_rate = int(random.gauss(mu, 10))
    max_rate = int(random.gauss(mu + 55, 25))
    while max_rate <= min_rate:
        max_rate = int(random.gauss(mu + 55, 25))
    avg = random.gauss((max_rate + min_rate) / 2, (max_rate - min_rate) / 5)
    duration = random.randint(10, 90)
    exercise = random.choice(['Running', 'Running', 'Running', 'Bicycling', 'Swimming', 'Swimming',
                              'Weight training'])
    row = [device, min_rate, max_rate, avg, duration, exercise]
    workout_dict['ID'].append(id)
    workout_dict['Measurement Device'].append(row[0])
    workout_dict['Heart Rate Min'].append(row[1])
    workout_dict['Heart Rate Max'].append(row[2])
    workout_dict['Heart Rate Avg'].append(row[3])
    workout_dict['Duration of exercise (min)'].append(row[4])
    workout_dict['Exercise Type'].append(row[5])

df = pd.DataFrame(workout_dict)

,ID,Measurement Device,Heart Rate Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type
0,902252007,B-Wolf,133,82,118.890640,84,Running
1,544578830,Skykandal,94,66,93.261689,54,Bicycling
2,832870883,Skykandal,78,66,72.156150,29,Swimming
3,554249407,Skykandal,123,45,91.836704,62,Bicycling
4,451383096,Skykandal,115,66,105.375030,43,Bicycling

View the first 5 rows of the dataframe stored in the variable named "df":

In [3]:
df.head()

,ID,Measurement Device,Heart Rate Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type
0,902252007,B-Wolf,133,82,118.890640,84,Running
1,544578830,Skykandal,94,66,93.261689,54,Bicycling
2,832870883,Skykandal,78,66,72.156150,29,Swimming
3,554249407,Skykandal,123,45,91.836704,62,Bicycling
4,451383096,Skykandal,115,66,105.375030,43,Bicycling

The id column uniquely identifies each row.

## Section 2.1: Columns

View names of the columns in the dataframe variable named 'df'.

In [4]:
df.columns

Index(['ID', 'Measurement Device', 'Heart Rate Max', 'Heart Rate Min',
       'Heart Rate Avg', 'Duration of exercise (min)', 'Exercise Type'],
      dtype='object')

### Columns

We will start by discussing how to access a column. The code below will print the Exercise type column.

In [5]:
df['Exercise Type']

0        Running
1      Bicycling
2       Swimming
3      Bicycling
4      Bicycling
         ...
495     Swimming
496     Swimming
497      Running
498    Bicycling
499    Bicycling
Name: Exercise Type, Length: 500, dtype: object

We can simply look up the column in the dataframe (which we have named `df`) by using the column name as the key.

The column data type is a Pandas series. The values from this result on the right side are the values in the column. The values on the left are simply index values, which are unique for each row.
The "Length" value gives the number of rows, and the "dtype" value indicates the "data type".

In [6]:
df['Heart Rate Max']

0      133
1       94
2       78
3      123
4      115
      ...
495    111
496    113
497    118
498     98
499    116
Name: Heart Rate Max, Length: 500, dtype: int64

You can see that this column is dtype `int64`. That's a dtype for integer numbers , which these all are. The Heart Rate Avg column, which is numeric but not integers, will be a floating point number, probably `float64`. The numbers at the end don't matter as much, just remember that there are `int`s for integers, `float`s for non-integer numbers (ones with decimal points, really), and `object`s for text (and some other less common things).

It is possible to loop over this column with a for loop. However, Pandas often has shortcuts for manipulating the data that make the for loop needed less often.

In [7]:
for x in df['Heart Rate Max']:
    print(x)

133
94
78
123
115
131
117
96
130
137
146
123
166
113
115
139
140
155
134
151
131
125
146
121
119
142
143
139
138
123
118
174
84
136
138
129
117
133
104
131
117
151
137
123
81
148
141
107
151
180
182
112
107
162
143
100
146
126
113
160
182
143
121
135
100
118
109
107
113
115
123
116
146
170
110
121
122
117
133
124
128
141
148
146
119
143
138
155
152
154
132
103
158
122
108
152
124
126
131
139
154
154
157
151
183
151
158
142
143
160
134
140
161
158
149
155
90
117
157
142
186
125
123
163
117
115
178
110
143
111
116
154
122
169
95
116
106
160
136
100
161
139
132
127
191
125
106
120
137
96
133
124
141
163
121
89
172
149
118
133
110
107
90
128
160
137
152
155
132
117
86
139
132
134
150
85
150
98
140
146
157
130
103
159
91
113
134
106
113
121
146
134
111
98
121
150
134
93
109
173
109
129
163
123
132
121
118
150
125
111
168
153
146
96
96
196
131
153
113
146
95
155
121
102
143
138
142
100
107
159
150
138
176
110
172
84
156
161
147
101
130
173
67
98
142
121
117
149
121
115
144
79
125
136
102
126
109
125
125
99
155
108
111
120
147
179
115
160
153
123
155
119
101
98
161
119
155
130
98
156
87
190
125
104
94
142
174
104
130
140
122
102
116
160
132
182
96
130
121
100
116
126
77
104
98
152
129
79
130
135
133
150
120
154
92
155
122
136
172
96
102
119
123
167
136
133
126
132
140
141
117
119
110
107
120
147
148
105
119
125
159
165
98
137
142
146
120
108
113
116
156
117
128
155
146
132
151
98
179
134
164
135
137
132
132
108
128
98
112
149
140
108
160
122
156
126
138
157
150
138
83
129
96
98
151
125
147
96
164
149
170
124
120
109
83
100
130
184
124
137
155
108
161
92
93
120
124
133
90
159
136
126
95
148
133
158
119
95
112
126
194
122
141
133
109
125
143
141
169
168
96
128
82
112
105
94
165
114
148
144
122
152
109
128
156
130
88
107
119
156
159
138
136
126
80
160
126
103
132
127
73
79
121
120
125
144
116
140
96
129
105
165
88
135
117
142
97
127
128
138
91
107
133
156
132
201
146
81
142
132
186
159
127
115
116
111
113
118
98
116

We can also access more than one column at once. We do this by passing a list of columns we want into the square brackets. Note that this means that we have two sets of square brackets, the inner one that defines the list and an outer one that says "get me these items from the dataframe".

In [8]:
df[['ID', 'Measurement Device']]

            ID Measurement Device
0    902252007             B-Wolf
1    544578830          Skykandal
2    832870883          Skykandal
3    554249407          Skykandal
4    451383096          Skykandal
..         ...                ...
495  327475478             B-Wolf
496  884726739          Skykandal
497  422636257          Skykandal
498  408861309          Skykandal
499  947601007          Skykandal

[500 rows x 2 columns]

#### Try writing some code in the space below that accesses more than one column at once. Access these columns: Measurement Device, Heart Rate Min, and Duration.

In [ ]:
# put your code here

How do you find the column names? In small dataframes you can get the column names in the same way you check the data: `df.head()`. The `head` method prints out the first five rows of the dataframe by default, but you can type a number in between the parenthesis to make it show a different number of rows.

`head` is a method of the dataframe. This means that you write `name of dataframe.head()`, and `head` then shows you the head of the dataframe you named. If your dataframe was named blood_counts_frame you would write `blood_counts_frame.head()`.

In [ ]:
df.head(10)

This code allows you to print just the column names:

In [13]:
print(list(df.columns))

['ID', 'Measurement Device', 'Heart Rate Max', 'Heart Rate Min', 'Heart Rate Avg', 'Duration of exercise (min)', 'Exercise Type']

We can also rename a column in a dataframe. For instance, this code renames the column 'Heart Rate Max' to 'Max'. 
To do this we use the dataframe `rename` method.

In [14]:
df.rename(columns={'Heart Rate Max': 'Max'}, inplace=True)
df.head()

,ID,Measurement Device,Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type
0,902252007,B-Wolf,133,82,118.890640,84,Running
1,544578830,Skykandal,94,66,93.261689,54,Bicycling
2,832870883,Skykandal,78,66,72.156150,29,Swimming
3,554249407,Skykandal,123,45,91.836704,62,Bicycling
4,451383096,Skykandal,115,66,105.375030,43,Bicycling

As you can see, `rename` is a method that is "attached" to the dataframe, so we use dot notation for it and then it automatically knows what dataframe it is renaming. There are several ways to specify that we are renaming columns. I think the easiest one to read is the `columns` argument. `columns` then equals a dictionary where the key is the current column name and the value is the new name. Note that we then have a comma, because the whole `columns={'Heart Rate Max': 'Max'}` section was just the first argument.

The `inplace` option is very common in pandas. When it is set to `True` whatever you are doing changes this dataframe. If it is set to `False` your operation generates a new dataframe that has been changed. By default it is `False`.

Use of the `False` option is demonstrated here.

In [ ]:
new_frame = df.rename(columns={'Max': 'MAX!!!!'}, inplace=False)
print('Original dataframe column names:', df.columns.values)
print('New dataframe column names:', new_frame.columns.values)

As you can see, Max was changed to MAX!!!! only in the new frame (imaginatively named "new_frame") and not in the original frame. This is very useful when you aren't sure if what you are doing will work the way you think it will, and don't want to mess up your original dataframe.

Since the `columns` argument of `rename` takes a dictionary you can change as many column names at once as you want.

#### Below, write code that changes the names of `Heart Rate Min` to `Min` and `Duration of exercise` to `Duration`. Then print one of them, using the new name, to make sure it worked.

In [ ]:
# put your code here

## Section 2.2: Rows and Cells

### Rows and Cells

Accessing rows works off of the index column of the dataframe. We can print the index for each row below just to remind ourselves what it looks like.

In [15]:
df.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499])

We can see that our index is just row numbers. In some cases it may be something different. You can reset the index to be the ID number, or anything else. But let's not do that, because that isn't useful for the sorts of things we're trying to do.

Instead, we will use the `loc` method of the dataframe to locate the row we want, by its index. Note that `loc` uses square brackets, like indexing from a list. Below, we will print out the second row (the first row would be index 0).

In [16]:
df.loc[1]

ID                            544578830
Measurement Device            Skykandal
Max                                  94
Heart Rate Min                       66
Heart Rate Avg                93.261689
Duration of exercise (min)           54
Exercise Type                 Bicycling
Name: 1, dtype: object

We can also pass slice notation to `loc`. The code below replicates `df.head()`. It shows rows with index 0, 1, 2, 3, and 4.

In [20]:
df.loc[0:4]

,ID,Measurement Device,Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type
0,902252007,B-Wolf,133,82,118.890640,84,Running
1,544578830,Skykandal,94,66,93.261689,54,Bicycling
2,832870883,Skykandal,78,66,72.156150,29,Swimming
3,554249407,Skykandal,123,45,91.836704,62,Bicycling
4,451383096,Skykandal,115,66,105.375030,43,Bicycling

We can also use `loc` on a column, to give us a single cell. The code below gives us the ID at index 3.

In [21]:
df['ID'].loc[3]

554249407

We can also do this with the multiple column lookup.

In [22]:
df[['ID', 'Measurement Device']].loc[3]

ID                    554249407
Measurement Device    Skykandal
Name: 3, dtype: object

We can also get a cell directly with `loc` by specifying both row and column. If you give `loc` a tuple it will assume that it is (row, column). The code below will return the maximum heart rate ('Max') for the fourth row (index 3).

In [ ]:
df.loc[(3, 'Max')]

You can also get both multiple columns and multiple rows, to get a sub-dataframe.

In [23]:
df[['ID', 'Measurement Device']].loc[1:3]

          ID Measurement Device
1  544578830          Skykandal
2  832870883          Skykandal
3  554249407          Skykandal

#### Below, write some code that does the inverse of `head` and prints the last five rows of the dataframe. However, leave out the ID column.

In [ ]:
# your code goes here

(If you actually just want the inverse of `head` there's a command `tail` that does this. However, the purpose of the exercise above is practice.)

## Section 2.3 - Modifying Dataframes

### Modifying Dataframes

Adding a column to a dataframe is quite easy. Below, we will create a column that is simply the maximum heart rate divided by 2.

In [25]:
df.head()

,ID,Measurement Device,Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type
0,902252007,B-Wolf,133,82,118.890640,84,Running
1,544578830,Skykandal,94,66,93.261689,54,Bicycling
2,832870883,Skykandal,78,66,72.156150,29,Swimming
3,554249407,Skykandal,123,45,91.836704,62,Bicycling
4,451383096,Skykandal,115,66,105.375030,43,Bicycling

In [30]:
df['A'] = 'A'
df.head()

,ID,Measurement Device,Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type,A,Max minus 2
0,902252007,B-Wolf,133,82,118.890640,84,Running,A,131
1,544578830,Skykandal,94,66,93.261689,54,Bicycling,A,92
2,832870883,Skykandal,78,66,72.156150,29,Swimming,A,76
3,554249407,Skykandal,123,45,91.836704,62,Bicycling,A,121
4,451383096,Skykandal,115,66,105.375030,43,Bicycling,A,113

In [31]:
df['Max minus 2'] = df['Max'] - 2
df.head()

,ID,Measurement Device,Max,Heart Rate Min,Heart Rate Avg,Duration of exercise (min),Exercise Type,A,Max minus 2
0,902252007,B-Wolf,133,82,118.890640,84,Running,A,131
1,544578830,Skykandal,94,66,93.261689,54,Bicycling,A,92
2,832870883,Skykandal,78,66,72.156150,29,Swimming,A,76
3,554249407,Skykandal,123,45,91.836704,62,Bicycling,A,121
4,451383096,Skykandal,115,66,105.375030,43,Bicycling,A,113

All we had to do here was name a new column (much like adding a key to a dictionary) and set it equal to something else.

However, the thing we set it equal to must be either a single item or a list equal in length to the other columns. The code below shows what happens with a single item: it is just repeated in every cell of that column.

In [ ]:
df['Two'] = 2
df.head()

This will break. We're specifying a length for the column, but it's two, and the other columns are length 500.

In [ ]:
df['Breaking'] = [2, 2]

In later notebooks we'll generate data the same length as existing columns and fill new columns with it. For now, just remember not to fill a column with data that has a length but is the wrong length.

How do we remove a column? We use the `drop` method, which has a similar argument structure to `rename`. Here we just list the column names to drop. Again, `inplace=True` means "do this to the current dataframe".

The code below drops/removes the column named 'Two'.

In [ ]:
df.drop(columns=['Two'], inplace=True)
df.head()

If you run that code above again it will fail, since the column Two no longer exists to be dropped.

The `drop` command can also be used to drop rows. By default, `drop` actually expects you to drop rows, and so you can simply provide an index to drop.

In [ ]:
df.drop(0, inplace=True)
df.head()

However, while column creation and deletion are common in analysis, adding and deleting rows is less useful. Most row deletion happens as part of filtering, which we will cover in an upcoming notebook.

Creating rows is less useful (normally), and is somewhat harder to do. To add a row you create an entire new dataframe and then use the `concat` function to add the dataframes together. We won't cover this further here.

### Creating Dataframes
Creating dataframes can be useful in analysis. You may want to process data and make a new frame from the processed data only. So, how do we make a dataframe? The easiest way is to make a dictionary and then use `pd.DataFrame` to make it into a dataframe.

Why `pd.DataFrame`? `DataFrame` is a function from the pandas library. The `pd.DataFrame` notation means "DataFrame, from the pandas library" (much like `df.head()` means "head, of the frame df"). This is one reason we want to import pandas and change the name to pd, because we'll type pd a lot doing analysis with pandas.

In [ ]:
test_dict = {'Column One': [1, 2], 'Column Two': [20, 78], 'Colum Three': ['C', 'K']}
new_df = pd.DataFrame(test_dict)
new_df.head()

#### Below, make a dictionary with at least three keys. One of the lists of values should be all numbers. Then turn it into a dataframe and use `head` to check that it worked.

In [ ]:
# your code goes here

#### Now, create a new column that is your column of numbers divided by two. Again, use `head` to check your work.

In [ ]:
# your code goes here

#### Finally, drop one of your columns. As before, use `head` to check that it happened correctly.

In [ ]:
# your code goes here

### Combining Dataframes
One thing that you do often need to do when you make dataframes is merge them together. We will need some very small dataframes to see this behavior in.

In [ ]:
dict_1 = {'ID': [1, 3, 5, 7, 9], 'B': [True, True, False, True, False]}
dict_2 = {'ID': [1, 2, 3, 4, 5], 'C': [57, 89, 23, 12, 65]}
dict_3 = {'ID_num': [1, 2, 3, 4, 5], 'C': [57, 89, 23, 12, 65]}
dict_4 = {'ID': [1, 2, 3, 4, 5], 'B': [57, 89, 23, 12, 65]}

frame_1 = pd.DataFrame(dict_1)
frame_2 = pd.DataFrame(dict_2)
frame_3 = pd.DataFrame(dict_3)
frame_4 = pd.DataFrame(dict_4)

frame_1 and frame_2 are meant to be matched. Each contains some of the same IDs but different variables in each frame. frame_3 is frame_2 but now ID is ID_num. frame_4 is frame_2 but now C is called B.

The simplest way to combine two dataframes is to just stick them together. `concat` will do this. It's not a dataframe method, so we write it `pd.concat` so Python knows to go looking for the function in pands.

In [ ]:
pd.concat([frame_1, frame_2])

The syntax is simple: pass a list of frames to concatenate (add together).

#### Below, write code to concatenate all three frames together at once.

In [ ]:
# your code goes here

There are some other `concat` options, but the issue with `concat` is that items that are the same (like ID 1) just get repeated. We would really like to attach dataframes in such a way that all items with IDs get their data filled in from B and C. To do this we use `pd.merge`. Here, we can only merge two frames at a time, so instead of a list we just pass both frames as arguments.

In [ ]:
m = pd.merge(frame_1, frame_2)
m.head()

This gave us columns ID, B, and C for all items present in ID in both dataframes (all odd numbers between 1-5). Why ID? Because the column names matched.
       
If we attempt to merge frame_1 with frame_4 we do need to specify what column to use. Remember, frame_4 is frame_2, except that column C is called B, which means that frame_1 and frame_4 have two identical column names. If we do nothing this is what we get:

In [ ]:
m = pd.merge(frame_1, frame_4)
m.head(10)

Since no rows match in both ID and B we get nothing. We should specify that ID is the real match using the `on` keyword.

In [ ]:
m = pd.merge(frame_1, frame_4, on='ID')
m.head(10)

Note that this relabels the two different column Bs with underscore and a letter (x and y, by default). Columns with different names would not need this relabeling.

What if the columns are the same but don't have the same name? We can name equivalent columns with `right_on` and `left_on`. Right and left refer to the position of the dataframes in the argument list. (E.g., left is the first one, right is the second one.)

frame_3 was created to show this. It is frame_2, but with ID_num instead of ID.

In [ ]:
m = pd.merge(frame_1, frame_3, left_on='ID', right_on='ID_num')
m.head(10)

We still get both named columns, but we specified that ID on the left (frame_1) was to be matched to ID_num on the right (frame_3) and so we successfully combined the dataframes intelligently.

However, right now we got only items in ID that were present in both dataframes.We can change this behavior with the keyword `how`. We have four simple options:
- Inner: This is the default, where only items present in the matching column in both frames are included.
- Outer: All items are included.
- Left: All columns in the left dataframe (in the order you write them in `pd.merge()`) are kept, ones only present in the right dataframe are discarded.
- Right: The opposite of left.

We simply write `how=` and then the lowercase name of the join type in either single or double quotes. Here's an outer join version of merging frame_1 and frame_2.

In [ ]:
m = pd.merge(frame_1, frame_2, how='outer')
m.head(10)

You'll see that any column with no data, like column B for where A is 4, becomes NaN. We'll discuss this more in the next notebook, but NaN is a blank cell.

#### Below, run a left merge on frame_1 and frame_3. Remember to specify how to merge them!

In [ ]:
# your code goes here

That concludes data structures. Next up, we'll discuss cleaning up issues like these blank cells we created in our merges.